{
    "CIS":"CIS - Cislocative: The cislocative indicates direction towards a point of reference with verbs that involve motion in a certain direction.",
    "COIN":"COIN - Coincident: The coincident is used to indicate simultaneous occurrence (i.e. event takes place at the same time as another event) in contexts in which the focus is on the time of the action.",
    "CONTR":"CONTR - Contrastive: The contrastive indicates difference/contrast, and it is often used to express negation.",
    "DUP":"DUP - Duplicative: The duplicative conveys the basic meaning of two.",
    "FACT":"FACT - Factual: The factual is a modal prefix that is used to refer to an action or event that is completed, and thus can be considered an established fact.",
    "FUT":"FUT - Future: The future is a modal prefix that is used to refer to an action or event that has not taken place yet but will take place sometime in the future.",
    "ITER":"ITER - Iterative: The iterative expresses the repetition of an action or event observable on one single occasion.",
    "NEG":"NEG - Negative: The negative is used to express negation.",
    "OPT":"OPT - Optative: The optative is a modal prefix that is used to refer to an action or event that has not taken place yet and either might take place, ought to take place, or might take place if certain conditions are met.",
    "PART":"PART - Partitive: The partitive is used to describe manner or extent. The partitive conveys the way an action is carried out or the extent to which the condition or state described by the verb is true.",
    "TRANS":"TRANS - Translocative: The translocative indicates motion away from a point of reference, usually the speaker.",
    "HAB":"HAB - Habitual: The habitual aspect is used to express an ongoing or continuous action, as well as recurring events or actions.",
    "FOR.PST":"Former past: The former past is used to describe an action or event that occurred regularly in the past but has stopped occurring.",
    "PUNC":"PUNC - Punctual: The punctual aspect describes an action that is a completed event.",
    "STAT":"STAT - Stative: The stative aspect describes states. The state may be an inherent condition or it may be the result of an earlier action.",
    "AUG":"AUG - Augmentative: The augmentative attaches to a noun to indicate that it is of a large size.",
    "BEN":"BEN - Benefactive: The benefactive is used to say that someone/something was affected by the action either positively or negatively.",
    "CAUS":"CAUS - Causative: The causative adds a participant to the event: someone who caused it to occur.",
    "CONT":"CONT - Continuative: The continuative indicates that an action is still in progress.",
    "DIM":"DIM - Diminutive: The diminutive in Kanien'kéha is most often seen on kinship terms. This suffix will almost always be attached to the roots of the kinship terms.",
    "DIST":"DIST - Distributive: The distributive acts as a sort of pluralizer. It can indicate that an action happens many times or that there are multiple participants.",
    "INCH":"INCH - Inchoative: The inchoative is used with stative verbs, and it describes the idea of becoming.",
    "LOC":"LOC - Locative: The locative suffixes to nouns to indicate the location of something/someone.",
    "NMLZ":"NMLZ - Nominalizer: In Kanien'kéha, many nouns are formed by nominalizing verbs, and the nominalizer affix allows this to occur.",
    "NSF":"NSF - Noun Suffix: This suffix attaches to noun roots, and it indicates that the word should be treated as a noun.",
    "PURP":"PURP - Purposive: The purposive is used to express moving somewhere to perform an action. In English this means something similar to 'to go do something.'",
    "REP":"REP - Repetitive: The repetitive often signals that an action has been performed again. It can also be used to describe situations where something returns to its original state.",
    "SRFL":"SRFL - Semi-reflexive: The semi-reflexive is often used to turn a verb that normally takes 2 participants (a doer and an undergoer) into a verb that has only one participant. It is commonly used with body parts.",
    "EPEN":"EPEN - Epenthetic vowel: This marking refers to a vowel that is inserted in between unallowable consonant clusters (e) or inserted at the start of the word to assign stress (i).",
    "JR":"JR - Joiner vowel: This marking refers to a vowel that gets inserted after a verb or noun root that ends in a consonant, and before another consonant.",
    "NE":"NE: The NE particle has many uses. It occurs wherever something is deemed specific in its reference to the main statement or focus of discussion.",
    "SHE'S":"SHE'S: The particle SHE'S roughly translates to 'usually' in English (Karin Michelson, p.c.) while also emphasizing a past element—subsequently placing the situation in remote past.",
    "ASSERT":"ASSERT: An assertional particle is used to show that the speaker believes what they say to be true.",
    "EMPH":"EMPH - Emphatic: The emphatic particle is used to indicate emphasis.",
    "EXCL":"EXCL - Exclamation: An exclamation is an utterance made to indicate strong emotion or show emphasis.",
    "Q":"Q - Question: This particle is used to ask a question.",
    "1SG.A":"1SG.A - First-person singular agent. In Kanien'kéha classrooms, this pronoun might be referred to as a 'subjective pronoun' or 'red pronoun.'",
    "1SG.P":"1SG.P - First-person singular patient.",
    "2SG.A":"2SG.A - Second-person singular agent.",
    "2SG.P":"2SG.P - Second-person singular patient.",
    "MSG.A":"MSG.A - Third-person masculine singular agent.",
    "MGS.P":"MSG.P - Third-person masculine singular patient.",
    "1EX.DU.A":"1EX.DU.A - First-person exclusive dual agent.",
    "MDU.A":"MDU.A - Third-person masculine dual agent.",
    "N.A":"N.A - Neuter agent",
    "N.P":"N.P - Neuter patient",
    "1IN.PL.A":"1IN.PL.A - First-person inclusive plural agent.",
    "1IN.DU.A":"1IN.DU.A - First-person inclusive dual agent.",
    "FZ.DU.A":"FZ.DU.A - Third-person feminine-zoic dual agent.",
    "FZ.PL.A":"FZ.PL.A - Third-person feminine-zoic plural agent.",
    "MPL.A":"MPL.A - Third-person masculine plural agent.",
    "MPL>1SG":"MPL>1SG - Third-person masculine plural to first-person singular transitive prefix.",
    "1SG>2PL":"1SG>2PL - First-person singular to second-person plural transitive prefix.",
    "1SG>2SG":"1SG>2SG - First-person singular to second-person singular transitive prefix.",
    "MSG>1SG":"MSG>1SG - Third-person masculine singular to first-person singular transitive prefix.",
    "MPL>MSG":"MPL>MSG - Third-person masculine plural to third-person masculine singular transitive prefix.",
    "MSG>MSG":"MSG>MSG - Third-person masculine singular to third-person masculine singular transitive (not reflexive) prefix.",
    "MSG>1PL.IN":"MSG>1PL.IN - Third-person masculine singular to first-person inclusive plural transitive prefix.",
    "1SG>2DU":"1SG>2DU - First-person singular to second-person dual transitive prefix.",
    "2SG>MPL":"2SG>MPL - Second-person singular to third-person masculine plural prefix.",
    "2PL>MPL":"2PL>MPL - Second-person plural to third-person masculine plural prefix.",
    "1SG>MPL":"1SG>MPL - First-person singular to third-person masculine plural prefix.",
    "2SG>3PL":"2SG>3PL - Second-person singular to third-person plural prefix.",
    "2PL>3PL":"2PL>3PL - Second-person plural to third-person plural prefix.",
    "1SG>3PL":"1SG>3PL - First-person singular to third-person plural prefix."
}
